

<?php include "./head.php"; ?>

<body>

<div id="siteWrapper" class="siteWrap">

    <header class="site-header" style="background-image: url(content/about-Bg.jpg);">
        <div class="overlay" style="padding: 0 !important;">


            <?php include "./header.php"; ?>













            <div class="headingIntro">
                <p>
                    <em>Немного информации</em>
                </p>
                <p>
                    <strong id="mainHeroTitle">Обо мне</strong>
                </p>



            </div>
        </div>
    </header>

    <!-- Начало "промо" раздела -->
    <main id="page">
        <div id="content">
            <div class="page-content">
                <div class="layout">

                    <h1 class="introBlockHeading">Привет, меня зовут Виталий</h1>
                    <div class="briefBackgroundBlock">
                        <div class="MyColSide">
                            <div class="My-block-image"></div>
                        </div>
                        <div class="MyCol2">
                            <div class="paddingMy">
                                <p class="homepageDescription">Я - веб-дизайнер и разработчик широкого профиля. Специализируюсь на верстке и настройке серверной части веб-приложений и сайтов. Я искренне считаю, что высококлассный веб-дизайн должен быть чистым и простым, и, в то же время, привлекающим внимание пользователя.</p>
                            </div>
                        </div>
                        <div class="MyColSide">
                            <div class="My-block-image"></div>
                        </div>
                    </div>

                    <div class="hrContainer">
                        <hr class="hrHomePage1">
                    </div>

                    <h1 class="introBlockHeading">Что я могу Вам предложить</h1>
                    <div class="myServices">

                        <div class="wrap cf text-c">
                            <div class="splitColumnsMy">

                                <svg id="Layer_1" class="icon icon-design large-icon" xml:space="preserve" enable-background="new 0 0 100 100" viewBox="0 0 100 100" height="100px" width="100px" y="0px" x="0px" version="1.1" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns="http://www.w3.org/2000/svg">
                                    <path id="development1" d="M35.845,61.275l-10.72-5.09c-1.209-0.572-1.94-1.463-1.94-2.703v-0.318c0-1.24,0.731-2.131,1.94-2.704l10.72-5.089 c0.381-0.191,0.731-0.318,1.177-0.318c1.018-0.031,1.94,0.859,1.94,2.004c0,0.922-0.509,1.559-1.336,1.94l-9.606,4.294l9.606,4.295 c0.827,0.381,1.336,1.113,1.336,2.004c0,1.177-0.922,2.004-2.1,1.972C36.513,61.562,36.163,61.435,35.845,61.275z" stroke="#333333" stroke-width="1" ></path>
                                    <path id="development2" d="M41.889,66.047l12.438-25.988c0.35-0.731,0.922-1.113,1.686-1.113c1.018,0,1.876,0.859,1.876,1.813 c0,0.35-0.127,0.7-0.222,0.923L45.229,67.669c-0.35,0.731-0.922,1.113-1.686,1.113c-1.018,0-1.876-0.858-1.876-1.813 C41.667,66.619,41.793,66.27,41.889,66.047z" stroke="#333333" stroke-width="1" />
                                    <path id="development3" d="M64.155,45.371l10.72,5.089c1.208,0.573,1.94,1.464,1.94,2.704v0.318c0,1.24-0.731,2.131-1.94,2.703l-10.72,5.09 c-0.381,0.191-0.731,0.318-1.177,0.318c-1.018,0.031-1.94-0.859-1.94-2.004c0-0.923,0.509-1.559,1.336-1.94l9.606-4.295 l-9.606-4.294c-0.827-0.381-1.336-1.113-1.336-2.004c0-1.177,0.923-2.004,2.1-1.973C63.487,45.084,63.837,45.212,64.155,45.371z" stroke="#333333" stroke-width="1" />
                                    <path id="development4" d="M92.5,21c0-1.657-1.343-3-3-3h-80c-1.657,0-3,1.343-3,3v59c0,1.657,1.343,3,3,3h80c1.657,0,3-1.343,3-3V21z M26,20.833 c1.196,0,2.167,0.97,2.167,2.167s-0.97,2.167-2.167,2.167s-2.167-0.97-2.167-2.167S24.804,20.833,26,20.833z M20,20.833 c1.196,0,2.167,0.97,2.167,2.167s-0.97,2.167-2.167,2.167s-2.167-0.97-2.167-2.167S18.804,20.833,20,20.833z M14,20.833 c1.196,0,2.167,0.97,2.167,2.167s-0.97,2.167-2.167,2.167s-2.167-0.97-2.167-2.167S12.804,20.833,14,20.833z M88.5,79h-78V29h78V79z " stroke="#333333" stroke-width="1" />
                                </svg>

                                <h2>Разработка</h2>
                                <p class="servicesParagraph">Прежде всего - я программист, дизайн - это мое хобби. Я специализируюсь и на front-end, и на back-end разработке, пишу чистый и понятный код, используя популярные библиотеки и фреймвёрки. В работе руководствуюсь принципом Стивена Кинга: "Вторая версия написанного - это первая версия, минус 15%".</p>
                            </div>
                            <div class="splitColumnsMy">

                                <svg id="Layer_1" class="icon icon-design large-icon" xml:space="preserve" enable-background="new 0 0 100 100" viewBox="0 0 100 100" height="100px" width="100px" y="0px" x="0px" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns="http://www.w3.org/2000/svg" version="1.1">
                                    <path id="design1" d="M68.736,69.021c0-1.055,0-2.127,0-3.203H80.33h1.066c1.77,0,3.203-1.435,3.203-3.202V18.841v-1.067 c0-1.77-1.435-3.203-3.203-3.203H18.765c-1.771,0-3.203,1.434-3.203,3.203v1.067v43.775c0,1.769,1.433,3.202,3.203,3.202h1.067 h43.682c0,1.078,0,2.152,0,3.203h-4.447v1.066c0,0.59-0.478,1.067-1.068,1.067h-12.81c-0.592,0-1.068-0.479-1.068-1.067v-1.066H2.75 v2.135c0,0,0,3.203,3.203,3.203h57.561c0,1.717,0,3.199,0,4.291c0,6.798,0.327,14.35,2.938,14.35c2.61,0,2.284-6.797,2.284-14.35 c0-1.153,0-2.627,0-4.291h25.473c3.203,0,3.203-3.203,3.203-3.203v-2.135H68.736z M19.833,61.549V18.841H80.33v42.708H68.736 c0-2.98,0-5.742,0-7.824H69.7l-0.999-8.438c1.754-0.736,2.805-2.354,3.054-4.024c0.752-5.052-2.301-5.747-2.456-7.941 c-0.078-1.115,0.396-2.392,1.325-3.499c0.955-1.146,2.173-2.329,2.173-2.329s-3.371-0.092-5.286,0.532 c-3.391,1.108-6.577,4.299-7.399,7.845c-1.008,4.351-0.082,7.825,3.438,9.223l-1.022,8.634h0.988c0,2.084,0,4.852,0,7.823 L19.833,61.549L19.833,61.549z" stroke="#333333" stroke-width="1">
                                </svg>

                                <h2>Дизайн</h2>
                                <p class="servicesParagraph">
                                    Веб-дизайн - это моя страсть. Я люблю свежий, стильный и неповторимый дизайн, поэтому создал собственный алгоритм, который позволяет мне писать уникальные и привлекательные сайты.
                                </p>
                            </div>
                        </div>

                    </div>
                </div>
            </div>
        </div>
    </main>
    <!-- конец "промо"-раздела -->


<?php include "./footer.php"; ?>