

<?php include "./head.php"; ?>

<body>

<div id="siteWrapper" class="siteWrap">

    <header class="site-header" style="background-image: url(content/articles.jpg);">
        <div class="overlay" style="padding: 0 !important;">


            <?php include "./header.php"; ?>













            <div class="headingIntro">
                <p>
                    <em>Мои статьи о разработке и дизайне</em>
                </p>
                <p>
                    <strong id="mainHeroTitle">Статьи</strong>
                </p>



            </div>
        </div>
    </header>

    <main id="page">
        <div id="content">
            <div class="page-content">
                <div class="layout">

                    <main id="blogPostContainer" class="blogContent">
                        <div id="blogWrap" class="wrap" style="padding: 0px;">

                            <div class="blog-posts clearfix" style="margin-top: 1%;">
                                <article class="postSingle">
                                    <header class="entry-header">
                                        <p class="entry-meta">
                                            <span>Опубликовано</span>
                                            <time class="entry-time">21.04.2020 в 15:08</time>


                                        </p>

                                        <h1 class="introBlockHeading largerHeading">Интерактивный дизайн</h1>

<div class="blogPostImage">
    <div class="aboutPillar"><div class="paddingMy"></div></div>

    <div class="wrapAbout">
        <a title="Пишем игру на чистом Javascript" href='interact.php'>
            <img alt="Пишем игру на чистом Javascript" src="content/inter-design.jpg" style="border-radius:50%">
        </a>
    </div>
    <div class="aboutPillar"><div class="paddingMy"></div></div>
</div>
</header>

<div class="textParagraphBlog" style='margin-top:30px'>

    <p class="articleIntro">
        Большой проблемой для онлайн бизнеса было отсутствие моментального взаимодействия с посетителями сайтов.
        Если в оффлайн-магазине сотрудник может сразу же ответить на вопросы покупателя, узнать его предпочтения и предложить наиболее подходящий вариант, то в Интернете менеджерам приходится лишь догадываться о том, как будет действовать человек по ту сторону монитора.
        На данный момент решение этой проблемы уже найдено. Интерактивный дизайн представляет собой процесс коммуникации, который непосредственно влияет на мышление потребителя с помощью интеллектуальных эмоций, вызываемых широкими возможностями flash-технологий.
        С помощью интерактивного дизайна создаются сайты, которые могут "общаться" пользователями. </p>




    <p>Интерактивный дизайн используется при разработке веб-сайтов, программных продуктов, интерфейсов, игр. Все эти продукты создаются на основе взаимодействия носителя информации и пользователя.

        Создание интерактивного дизайна представляет собой трудоемкий процесс, при котором выполняется удачное комбинирование контента, графики, визуальных, звуковых эффектов и программирования.</p>
    <p>Разработка идеи. На первоначальном этапе мы осмысливаем проект и определяем вместе с клиентом идею оформления, функциональность и прочие требования.
        Все это закрепляется в техническом задании. После оформления задания мы ставим планы перед художниками, дизайнерами, программистами и верстальщиками.
        При этом мы генерируем дополнительные возможности совершенствования проекта.</p>
    <h2>Вызываем эмоции и яркие впечатления у потребителя</h2>
    <p>Интерактивный дизайн характеризируется более эмоциональным восприятием информации благодаря применению чистой графики или профессионально исполненных иллюстраций.
        В каждом проекте необходимо участие не только дизайнеров, но и художников, которые в совместной работе создают запоминающиеся оригинальные образы.
        Именно такие работы,в отличие от классического дизайна, оказывают большее влияние на аудиторию.
    </p>

</article>
</div>
                        </div>
                </div>
            </div>
        </div>
</div>
</div><!-- конец контейнера блога -->


<?php include "./footer.php"; ?>