

<?php include "./head.php"; ?>

<body>

<div id="siteWrapper" class="siteWrap">

    <header class="site-header" style="background-image: url(content/articles.jpg);">
        <div class="overlay" style="padding: 0 !important;">


            <?php include "./header.php"; ?>













            <div class="headingIntro">
                <p>
                    <em>Мои статьи о разработке и дизайне</em>
                </p>
                <p>
                    <strong id="mainHeroTitle">Статьи</strong>
                </p>



            </div>
        </div>
    </header>

    <main id="page">
        <div id="content">
            <div class="page-content">
                <div class="layout">

                    <main id="blogPostContainer" class="blogContent">
                        <div id="blogWrap" class="wrap" style="padding: 0px;">

                            <div class="blog-posts clearfix" style="margin-top: 1%;">
                                <article class="postSingle">
                                    <header class="entry-header">
                                        <p class="entry-meta">
                                            <span>Опубликовано</span>
                                            <time class="entry-time">21.04.2020 в 15:08</time>


                                        </p>

                                        <h1 class="introBlockHeading largerHeading">Интерактивный дизайн</h1>

<div class="blogPostImage">
    <div class="aboutPillar"><div class="paddingMy"></div></div>

    <div class="wrapAbout">
        <a title="Пишем игру на чистом Javascript" href='interact.php'>
            <img alt="Пишем игру на чистом Javascript" src="content/inter-design.jpg" style="border-radius:50%">
        </a>
    </div>
    <div class="aboutPillar"><div class="paddingMy"></div></div>
</div>
</header>

<div class="textParagraphBlog" style='margin-top:30px'>

    <p class="articleIntro">
        Дизайн играет ключевую роль в повышении популярности и конверсии сайта. Интерактивный, то есть динамически формируемый, дизайн - это будущее веб-программирования.
        Настройка странички под интересы и нужды пользователя, без потери смысловой нагрузки сайта, позволяет значительно увеличить доверие посетителей портала. </p>




    <p>В настоящее время интерактивный дизайн, используется в приложениях и на сайтах, на которых люди проводят много времени.
        Пользователю дается возможность выбрать цветовую тему интерфейса, настроить блоки и разделы меню, добавить виджеты и инструменты.
        </p>
    <p>Создать качественный интерактивный дизайн приложения сложно, не только потому что это трудоемкий процесс, но и потому что для разработки объемных модулей нужна команда высококлассных специалистов.
        Чем менее жестко закодирован сайт, чем больше в нем динамических элементов, тем проблематичнее его обслуживание, поддержка и обновление.</p>
    <h2>Простота - символ профессионализма</h2>
    <p>Почему так важно, чтобы над интерактивным приложением работали профессионалы, можно наглядно посмотреть на примере украинского Приватбанка.
        Десять лет назад зарубежные специалисты создали не имеющее аналогов мощное банковское приложение Приват24, интегрированное не только на сайте, но и под мобильные платформы. </p>
    <p>Год назад руководство банка решило слегка обновить дизайн сайта и приложения, чтобы создать видимость бурной работы.
        Дизайн обновили, правда, особой красоты пользователи не заметили, зато производительность сайта упала в разы: скрипты стали грузиться долго, операции выполняться медленно:
        причем даже на пустой странице. </p>
    <p>Старая версия приложения со встроенными видеофреймами грузилась быстрее, чем обновленный портал практически без контента.
        Хорошо, что руководство банка быстро поняло свою ошибку: назвало обновление "Бета-версией" и дало возможность перейти на "Полную" (то есть старую) версию сайта. </p>
    <p>Интерактивный дизайн - это вещь серьезная и доступна она, к сожалению, далеко не всем.</p>

</article>
</div>
                        </div>
                </div>
            </div>
        </div>
</div>
</div><!-- конец контейнера блога -->


<?php include "./footer.php"; ?>